{
  "basics": {
    "name": "Vivek Ranjan",
    "label": "Lead Software Engineer",
    "picture": "https://vivekranjan.me/img/profile.png",
    "email": "vivek@vivekranjan.me",
    "website": "https://vivekranjan.me",
    "location": {
      "city": "New York",
      "countryCode": "US",
      "region": "New York"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "bcosynot",
        "url": "https://github.com/bcosynot"
      },
      {
        "network": "LinkedIn",
        "username": "vivekranjan1",
        "url": "https://www.linkedin.com/in/vivekranjan1"
      }
    ],
    "summary": "My passion is building software products that solve meaningful problems and enhance people's lives. I enjoy constantly exploring ways to level up my team, streamline the organization's software development process, and optimize our systems for efficiency and effectiveness."
  },
  "work": [
    {
      "company": "Renaissance Learning",
      "position": "Staff Software Engineer",
      "website": "https://www.renaissance.com/",
      "startDate": "2022-03-01",
      "highlights": [
        "Proposed and led a project that reduced costs by 73% while removing security and operational overhead by moving batch processing jobs from manually managed servers to AWS Fargate.",
        "Increased deployment frequency of these jobs by 40% by building a framework that allows developers across the organization to quickly and consistently configure deployments of these jobs with IaC in Python using AWS CDK and Docker.",
        "This framework also improved the observability of the batch jobs by automatically configuring them with Datadog and Cronitor. I built a custom CDK module to allow the setup of Cronitor monitors as part of deployments."
      ]
    },
    {
      "company": "Illuminate Education",
      "position": "Lead Software Engineer",
      "website": "https://www.illuminateed.com/",
      "startDate": "2019-07-01",
      "endDate": "2022-03-01",
      "highlights": [
        "Proposed and led a cross-functional effort to 2x our deployment frequency and remove ~10 hours/week of manual work by automating our monolith application's deployment and introducing end-to-end testing in our pipelines. Used Docker, YAML, shell scripts, AWS CLI and Cloudformation. ",
        "Proposed and led a project to remove the dependency of 4 weeks per year of engineering time to release content created by our User Training department. Achieved this by building a content management system using AWS Aurora serverless (Postgres), AWS Lambda, AWS API Gateway, Vue, Vuex, and Jest.",
        "Led a project to implement the UX redesign of crucial functionality that helps educators monitor the progress of millions of students by rewriting the frontend (Vue, Vuex, Jest) and rewriting parts of the backend (Java, Spring, REST, Hibernate, MS SQL Server, Groovy/Spock)."
      ]
    },
    {
      "company": "FastBridge Learning",
      "position": "Technical Team lead / Senior Software Engineer",
      "website": "https://fastbridge.org",
      "startDate": "2017-03-15",
      "endDate": "2019-06-30",
      "highlights": [
        "Led project to deliver a web application that provides easy access to millions of data points that help educators understand the performance of all students in a mid-western state.",
        "Worked with the team to build a datawarehouse in AWS Redshift, a microservice serving REST APIs using Spring Boot and JS-based frontend to render the data as user-friendly reports.",
        "Helped rewrite our software to take advantage of a more distributed system so that we can scale and serve our growing customer base."
      ]
    },
    {
      "company": "FastBridge Learning",
      "position": "Software Engineer",
      "website": "https://fastbridge.org",
      "startDate": "2015-06-15",
      "endDate": "2017-03-15",
      "highlights": [
        "4th engineer at an early-stage EdTech startup (~10 employees). Helped educators understand the needs of millions of students in reading and math by building software across the entire stack for our web application.",
        "Backend - Spring (Boot, JPA, Data, Data REST, MVC), JPA/Hibernate, Microsoft SQL Server along with AWS Redshift and other AWS technologies.",
        "Frontend - HTML/CSS, Bootstrap and JavaScript (ES6, webpack, babel and jQuery)."
      ]
    },
    {
      "company": "University of Minnesota",
      "position": "Full Stack Software Engineer (Part-time)",
      "startDate": "2014-01-09",
      "endDate": "2015-05-24",
      "highlights": [
        "Using Java (Spring MVC) with HTML/CSS/JS, jQuery, and Microsoft SQL server, I added features to an existing web app to assess the reading abilities of 1000s of students and track their progress"
      ]
    },
    {
      "company": "Unique Identification Authority of India (Aadhaar)",
      "position": "Software Engineer (Intern)",
      "startDate": "2011-12-15",
      "endDate": "2012-06-15",
      "highlights": [
        "Decreased runtime by ~76% of de-duplication program (from ~25 hours to ~6 hours).",
        "Built tools to make the intake of millions of residents into the Indian government's universal identification program (Aadhaar) more efficient and accurate."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Astoria Digital",
      "position": "Community Engineer",
      "website": "https://astoria.digital/",
      "startDate": "2020-04-01",
      "endDate": "2020-09-01",
      "highlights": [
        "Helped build an open-source volunteer coordination and dispatch system in use by Astoria Mutual Aid Network - https://github.com/astoria-tech/volunteer-dispatch",
        "Built a system that helps community organizers keep track of waiting times at COVID testing sites in NYC - https://github.com/astoria-tech/nyc-covid19-testing-wait-times"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Minnesota",
      "area": "Computer Science",
      "studyType": "Master",
      "startDate": "2013-09-01",
      "endDate": "2016-12-20"
    },
    {
      "institution": "University of Mumbai",
      "area": "Information Technology",
      "studyType": "Bachelor",
      "startDate": "2008-08-01",
      "endDate": "2013-06-01"
    }
  ],
  "skills": [
    {
      "name": "Frontend",
      "keywords": [
        "HTML/CSS",
        "JavaScript",
        "React",
        "Vue"
      ]
    },
    {
      "name": "Backend",
      "keywords": [
        "Java",
        "Spring (Boot, MVC, JPA, Data, Data REST, MVC)",
        "SQL (MS SQL Server, Postgres, MySQL, AWS Redshift)",
        "Python",
        "NodeJS"
      ]
    },
    {
      "name": "Other",
      "keywords": [
        "Shell scripting",
        "Docker",
        "AWS services like IAM, ECS, ECR, Fargate, ElasticBeanstalk, Cloudformation, CDK, S3, Lambda"
      ]
    }
  ]
}
