{
  "basics": {
    "name": "Vivek Ranjan",
    "label": "Lead Software Engineer",
    "picture": "https://vivekranjan.me/img/profile.png",
    "email": "vivek@vivekranjan.me",
    "website": "https://vivekranjan.me",
    "location": {
      "city": "New York",
      "countryCode": "US",
      "region": "New York"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "bcosynot",
        "url": "https://github.com/bcosynot"
      },
      {
        "network": "LinkedIn",
        "username": "vivekranjan1",
        "url": "https://www.linkedin.com/in/vivekranjan1"
      },
      {
        "network": "book",
        "username": "Blog",
        "url": "https://prodlog.makerflow.co/"
      }
    ],
    "summary": "I find my calling in solving meaningful, real-world problems with full stack software development. I am relentless in continually discovering new ways to enhance our systems or advance our organizational software building practices. The challenge of finding solutions, presenting them, and delivering results fuels my passion every day."
  },
  "work": [
    {
      "company": "Renaissance Learning",
      "position": "Staff Software Engineer",
      "website": "https://www.renaissance.com/",
      "startDate": "2022-03-01",
      "highlights": [
        "Achieved 73% cost reduction by initiating project for moving batch jobs to AWS Fargate.",
        "Crafted a framework resulting in 40% boost in batch job deployment frequency and enabled other engineers to configure deployments with ease using IaC in Python with AWS CDK and Docker.",
        "Improved observability of batch jobs by automatically configuring them with Datadog and Cronitor. Built a custom CDK module for Cronitor monitors."
      ]
    },
    {
      "company": "Illuminate Education",
      "position": "Lead Software Engineer",
      "website": "https://www.illuminateed.com/",
      "startDate": "2019-07-01",
      "endDate": "2022-03-01",
      "highlights": [
        "Led project for UX redesign implementation of crucial progress monitoring tool used by educators and millions of students. Modernized frontend (Vue, Vuex, Jest) and optimized backend (Java, Spring, REST, Hibernate, MS SQL Server, Groovy/Spock).",
        "Eliminated 4 weeks per year of engineering time for content release by proposing and leading project to develop a content management system using AWS Aurora serverless (Postgres), Lambdas, API Gateway, Vue, Vuex, and Jest.",
        "Proposed and led cross-functional project resulting in 2X increase in deployment frequency and eliminating 10 hours per week of manual work by automating monolith deployments and introducing end-to-end testing in CI/CD pipelines using Docker, YAML, shell scripts, AWS CLI and Cloudformation."
      ]
    },
    {
      "company": "FastBridge Learning",
      "position": "Technical Team lead / Senior Software Engineer",
      "website": "https://fastbridge.org",
      "startDate": "2017-03-15",
      "endDate": "2019-06-30",
      "highlights": [
        "Led project to deliver a web application that provides easy access to millions of data points that help educators understand the performance of all students in a mid-western state.",
        "Worked with the team to build a datawarehouse in AWS Redshift, a microservice serving REST APIs using Spring Boot and JS-based frontend to render the data as user-friendly reports.",
        "Helped rewrite our software to take advantage of a more distributed system so that we can scale and serve our growing customer base."
      ]
    },
    {
      "company": "FastBridge Learning",
      "position": "Software Engineer",
      "website": "https://fastbridge.org",
      "startDate": "2015-06-15",
      "endDate": "2017-03-15",
      "highlights": [
        "4th engineer at an early-stage EdTech startup (~10 employees). Developed features end-to-end to help educators understand needs of millions of students in reading and math.",
        "Backend - Spring (Boot, JPA, Data, Data REST, MVC), JPA/Hibernate, Microsoft SQL Server along with AWS Redshift and other AWS technologies.",
        "Frontend - HTML/CSS, Bootstrap and JavaScript (ES6, webpack, babel and jQuery)."
      ]
    },
    {
      "company": "University of Minnesota",
      "position": "Full Stack Software Engineer (Part-time)",
      "startDate": "2014-01-09",
      "endDate": "2015-05-24",
      "highlights": [
        "Using Java (Spring MVC) with HTML/CSS/JS, jQuery, and Microsoft SQL server, I added features to an existing web app to assess the reading abilities of 1000s of students and track their progress"
      ]
    },
    {
      "company": "Unique Identification Authority of India (Aadhaar)",
      "position": "Software Engineer (Intern)",
      "startDate": "2011-12-15",
      "endDate": "2012-06-15",
      "highlights": [
        "Decreased runtime by ~76% of de-duplication program (from ~25 hours to ~6 hours).",
        "Built tools to make the intake of millions of residents into the Indian government's universal identification program (Aadhaar) more efficient and accurate."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Astoria Digital",
      "position": "Community Engineer",
      "website": "https://astoria.digital/",
      "startDate": "2020-04-01",
      "endDate": "2020-09-01",
      "highlights": [
        "Helped build an open-source volunteer coordination and dispatch system in use by Astoria Mutual Aid Network - https://github.com/astoria-tech/volunteer-dispatch",
        "Built a system that helps community organizers keep track of waiting times at COVID testing sites in NYC - https://github.com/astoria-tech/nyc-covid19-testing-wait-times"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Minnesota",
      "area": "Computer Science",
      "studyType": "Master",
      "endDate": "2016-12-20"
    },
    {
      "institution": "University of Mumbai",
      "area": "Information Technology",
      "studyType": "Bachelor",
      "endDate": "2013-06-01"
    }
  ],
  "skills": [
    {
      "name": "Frontend",
      "keywords": [
        "HTML/CSS",
        "JavaScript",
        "React",
        "Redux",
        "Vue",
        "Vuex",
        "Jest"
      ]
    },
    {
      "name": "Backend",
      "keywords": [
        "Java",
        "JUnit",
        "Groovy",
        "Spock",
        "Spring (Boot, MVC, JPA, Data, Data REST, MVC)",
        "SQL (MS SQL Server, Postgres, MySQL, AWS Redshift)",
        "Python",
        "NodeJS"
      ]
    },
    {
      "name": "Other",
      "keywords": [
        "Shell scripting",
        "Docker",
        "AWS services like IAM, ECS, ECR, Fargate, ElasticBeanstalk, Cloudformation, CDK, S3, Lambda"
      ]
    }
  ]
}
